VV_cases/V2_thermal/results/study_v2a/runs/004_data_v2a_ogrid_cylinder_validation/simulations/Re200_ogrid/openfoam_setup/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// V2A run 004: structured 8-block O-grid cylinder mesh
// Domain: 30.50D x 30.50D
// Circumferential cells: 128
// Radial cells: 80, radial expansion ratio: 40.0

scale 1;

vertices
(
    (0.006 0 -0.005)
    (0.004242640687 0.004242640687 -0.005)
    (3.673940397e-19 0.006 -0.005)
    (-0.004242640687 0.004242640687 -0.005)
    (-0.006 7.347880795e-19 -0.005)
    (-0.004242640687 -0.004242640687 -0.005)
    (-1.102182119e-18 -0.006 -0.005)
    (0.004242640687 -0.004242640687 -0.005)
    (0.183 0 -0.005)
    (0.183 0.183 -0.005)
    (1.120551821e-17 0.183 -0.005)
    (-0.183 0.183 -0.005)
    (-0.183 2.241103642e-17 -0.005)
    (-0.183 -0.183 -0.005)
    (-3.361655464e-17 -0.183 -0.005)
    (0.183 -0.183 -0.005)
    (0.006 0 0.005)
    (0.004242640687 0.004242640687 0.005)
    (3.673940397e-19 0.006 0.005)
    (-0.004242640687 0.004242640687 0.005)
    (-0.006 7.347880795e-19 0.005)
    (-0.004242640687 -0.004242640687 0.005)
    (-1.102182119e-18 -0.006 0.005)
    (0.004242640687 -0.004242640687 0.005)
    (0.183 0 0.005)
    (0.183 0.183 0.005)
    (1.120551821e-17 0.183 0.005)
    (-0.183 0.183 0.005)
    (-0.183 2.241103642e-17 0.005)
    (-0.183 -0.183 0.005)
    (-3.361655464e-17 -0.183 0.005)
    (0.183 -0.183 0.005)
);

blocks
(
    hex (0 8 9 1 16 24 25 17) (80 16 1) simpleGrading (40 1 1)
    hex (1 9 10 2 17 25 26 18) (80 16 1) simpleGrading (40 1 1)
    hex (2 10 11 3 18 26 27 19) (80 16 1) simpleGrading (40 1 1)
    hex (3 11 12 4 19 27 28 20) (80 16 1) simpleGrading (40 1 1)
    hex (4 12 13 5 20 28 29 21) (80 16 1) simpleGrading (40 1 1)
    hex (5 13 14 6 21 29 30 22) (80 16 1) simpleGrading (40 1 1)
    hex (6 14 15 7 22 30 31 23) (80 16 1) simpleGrading (40 1 1)
    hex (7 15 8 0 23 31 24 16) (80 16 1) simpleGrading (40 1 1)
);

edges
(
    arc 0 1 (0.005543277195 0.002296100594 -0.005)
    arc 16 17 (0.005543277195 0.002296100594 0.005)
    arc 1 2 (0.002296100594 0.005543277195 -0.005)
    arc 17 18 (0.002296100594 0.005543277195 0.005)
    arc 2 3 (-0.002296100594 0.005543277195 -0.005)
    arc 18 19 (-0.002296100594 0.005543277195 0.005)
    arc 3 4 (-0.005543277195 0.002296100594 -0.005)
    arc 19 20 (-0.005543277195 0.002296100594 0.005)
    arc 4 5 (-0.005543277195 -0.002296100594 -0.005)
    arc 20 21 (-0.005543277195 -0.002296100594 0.005)
    arc 5 6 (-0.002296100594 -0.005543277195 -0.005)
    arc 21 22 (-0.002296100594 -0.005543277195 0.005)
    arc 6 7 (0.002296100594 -0.005543277195 -0.005)
    arc 22 23 (0.002296100594 -0.005543277195 0.005)
    arc 7 0 (0.005543277195 -0.002296100594 -0.005)
    arc 23 16 (0.005543277195 -0.002296100594 0.005)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
        (11 12 28 27)
        (12 13 29 28)
        );
    }
    outlet
    {
        type patch;
        faces
        (
        (8 9 25 24)
        (15 8 24 31)
        );
    }
    top
    {
        type patch;
        faces
        (
        (9 10 26 25)
        (10 11 27 26)
        );
    }
    bottom
    {
        type patch;
        faces
        (
        (13 14 30 29)
        (14 15 31 30)
        );
    }
    cylinder
    {
        type wall;
        faces
        (
        (0 1 17 16)
        (1 2 18 17)
        (2 3 19 18)
        (3 4 20 19)
        (4 5 21 20)
        (5 6 22 21)
        (6 7 23 22)
        (7 0 16 23)
        );
    }
    front
    {
        type empty;
        faces
        (
        (0 1 9 8)
        (1 2 10 9)
        (2 3 11 10)
        (3 4 12 11)
        (4 5 13 12)
        (5 6 14 13)
        (6 7 15 14)
        (7 0 8 15)
        );
    }
    back
    {
        type empty;
        faces
        (
        (16 24 25 17)
        (17 25 26 18)
        (18 26 27 19)
        (19 27 28 20)
        (20 28 29 21)
        (21 29 30 22)
        (22 30 31 23)
        (23 31 24 16)
        );
    }
);

mergePatchPairs ();
