VV_cases/V2_thermal/results/study_v2a/runs/004_data_v2a_ogrid_cylinder_validation/simulations/Re200_ogrid/openfoam_setup/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    inlet
    {
        type            patch;
        nFaces          32;
        startFace       20352;
    }
    outlet
    {
        type            patch;
        nFaces          32;
        startFace       20384;
    }
    top
    {
        type            patch;
        nFaces          32;
        startFace       20416;
    }
    bottom
    {
        type            patch;
        nFaces          32;
        startFace       20448;
    }
    cylinder
    {
        type            wall;
        inGroups        1(wall);
        nFaces          128;
        startFace       20480;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          10240;
        startFace       20608;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          10240;
        startFace       30848;
    }
)

// ************************************************************************* //
