VV_cases/V2_thermal/results/study_v2a/runs/004_data_v2a_ogrid_cylinder_validation/simulations/Re200_ogrid/openfoam_setup/0/C
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
10240
(
(0.0061005368 0.00015052029 0)
(0.0063123308 0.00015718693 -2.0347115e-19)
(0.0065342489 0.00016417225 0)
(0.0067667752 0.00017149149 1.7085245e-19)
(0.0070104167 0.0001791606 0)
(0.0072657048 0.00018719631 0)
(0.0075331962 0.00019561614 2.5732422e-19)
(0.0078134743 0.00020443846 0)
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<vector> 
32
(
(-0.183 0.17728125 0)
(-0.183 0.16584375 0)
(-0.183 0.15440625 0)
(-0.183 0.14296875 0)
(-0.183 0.13153125 0)
(-0.183 0.12009375 0)
(-0.183 0.10865625 0)
(-0.183 0.09721875 0)
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<vector> 
32
(
(0.183 0.00571875 0)
(0.183 0.01715625 0)
(0.183 0.02859375 0)
(0.183 0.04003125 0)
(0.183 0.05146875 0)
(0.183 0.06290625 0)
(0.183 0.07434375 0)
(0.183 0.08578125 0)
...
)
;
    }
    top
    {
        type            calculated;
        value           nonuniform List<vector> 
32
(
(0.17728125 0.183 0)
(0.16584375 0.183 0)
(0.15440625 0.183 0)
(0.14296875 0.183 0)
(0.13153125 0.183 0)
(0.12009375 0.183 0)
(0.10865625 0.183 0)
(0.09721875 0.183 0)
...
)
;
    }
    bottom
    {
        type            calculated;
        value           nonuniform List<vector> 
32
(
(-0.17728125 -0.183 0)
(-0.16584375 -0.183 0)
(-0.15440625 -0.183 0)
(-0.14296875 -0.183 0)
(-0.13153125 -0.183 0)
(-0.12009375 -0.183 0)
(-0.10865625 -0.183 0)
(-0.09721875 -0.183 0)
...
)
;
    }
    cylinder
    {
        type            calculated;
        value           nonuniform List<vector> 
128
(
(0.0059963864 0.00014720302 0)
(0.0059819405 0.00044125444 0)
(0.0059530837 0.00073424284 0)
(0.0059098854 0.0010254624 0)
(0.0058524496 0.0013142115 0)
(0.0057809148 0.0015997946 0)
(0.0056954532 0.0018815236 0)
(0.0055962708 0.0021587199 0)
...
)
;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
